Revit 2027 API
DirectShapeType.IsValidShape(IList<GeometryObject>, DirectShapeTargetViewType) Method
 Validates view-specific shape to be stored in a DirectShapeType. Expects a non-default view type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidShape(
	IList<GeometryObject> shape,
	DirectShapeTargetViewType viewType
)
Public Function IsValidShape (
	shape As IList(Of GeometryObject),
	viewType As DirectShapeTargetViewType
) As Boolean
public:
bool IsValidShape(
	IList<GeometryObject^>^ shape,
	DirectShapeTargetViewType viewType
)
member IsValidShape :
        shape : IList<GeometryObject> *
        viewType : DirectShapeTargetViewType -> bool
Parameters
shape IList<GeometryObject>
 Shape of this object expressed as a collection of GeometryObjects. For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point, Curve and PolyLine. For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.
viewType DirectShapeTargetViewType
 The view type this shape is intended for.
Return Value
Boolean
 True if the supplied shape passes the validation criteria.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DirectShapeType Class
IsValidShape Overload
Autodesk.Revit.DB Namespace